In [1]:
!bq --location=US mk --dataset college_modeled

Dataset 'cs327e-sp2020:college_modeled' successfully created.

In [3]:
%%bigquery
create table college_modeled.Student as
select distinct sid, fname, lname, dob, 'CUR' as status
from college_staging.Current_Students
union all
select distinct sid, fname, lname, cast(dob as string) as dob, 'PRO' as status
from college_staging.New_Students;

Empty DataFrame
Columns: []
Index: []

In [4]:
%%bigquery
select * from college_modeled.Student order by sid limit 12;

        sid   fname     lname         dob status
0    aprilz   April     Lopez  01/10/2000    CUR
1    aprilz   April     Lopez  2000-01-10    PRO
2    bzen26   Biswa       Zen  04/22/1998    CUR
3     dchen   David      Chen  2000-08-22    PRO
4        jc   James      Cowe  2000-04-22    CUR
5    jerryh   Jerry  Hargrove  1999-01-03    CUR
6    jerryh   Jerry  Hargrove  01/03/1999    CUR
7     kev18   Kevin       Lin  05/10/1999    CUR
8   kgomez9   Katie     Gomez  2001-03-03    PRO
9     natea  Nathan  Anderson  2000-04-08    PRO
10   nitinm   Nitin     Mogal  1999-07-31    PRO
11    paulg    Paul      Gore  09/17/2000    CUR

In [5]:
%%bigquery
create table college_modeled.Teacher as
select distinct tid, instructor, dept
from college_staging.Classes
where tid is not null;

Empty DataFrame
Columns: []
Index: []

In [6]:
%%bigquery
select * from college_modeled.Teacher order by tid limit 12;

        tid           instructor              dept
0   abraham  Prof. Sarah Abraham                CS
1     bulko           bill bulko  Computer Science
2   cannata      Cannata, Philip                CS
3   cannata       PHILIP CANNATA                CS
4     fares          Fares Fraij                CS
5      koch           Koch, Hans              Math
6     mitra       Mitra, Shyamal                CS
7     mitra       MITRA, SHYAMAL  Computer Science
8   mueller       MUELLER, PETER              Math
9    neeman           JOE NEEMAN       Mathematics
10   scohen        Shirley Cohen  Computer Science
11     tran           Tran, Ngoc       Mathematics

In [7]:
%%bigquery
create table college_modeled.Class as
select distinct cno, cname, credits
from college_staging.Classes
where cno is not null;

Empty DataFrame
Columns: []
Index: []

In [8]:
%%bigquery
select * from college_modeled.Class order by cno limit 12;

       cno                             cname  credits
0   CS313E       Elements of Software Design        3
1   CS326E            Elements of Networking        3
2   CS327E             Elements of Databases        3
3   CS329E      Elements of Mobile Computing        3
4   CS329E       Elements of Web Programming        3
5   CS331E  Elements of Software Engineering        3
6    CS347                   Data Management        3
7    CS373       CS373: Software Engineering        3
8    M328K            Intro to Number Theory        3
9    M358K                Applied Statistics        3
10   M362K                     Probability I        3

In [9]:
%%bigquery
select count(*) from college_modeled.Class

   f0_
0   11

In [10]:
%%bigquery
select count(distinct cno) from college_modeled.Class

   f0_
0   10

In [11]:
%%bigquery
create table college_modeled.Teaches as
select distinct tid, cno
from college_staging.Classes
where tid is not null
and cno is not null;

Empty DataFrame
Columns: []
Index: []

In [12]:
%%bigquery
select * from college_modeled.Teaches order by tid limit 12;

        tid     cno
0   abraham  CS329E
1     bulko  CS313E
2   cannata   CS347
3   cannata  CS326E
4     fares  CS331E
5      koch   M328K
6     mitra  CS313E
7     mitra  CS329E
8   mueller   M362K
9    neeman   M362K
10   scohen  CS327E
11     tran   M358K

In [13]:
%%bigquery
create table college_modeled.Takes as
select distinct sid, cno, grade
from college_staging.Current_Students
where sid is not null
and cno is not null;

Empty DataFrame
Columns: []
Index: []

In [14]:
%%bigquery
select * from college_modeled.Takes order by sid limit 12;

       sid              cno grade
0   bzen26  CS313E - Fall18    B+
1       jc           CS327E  None
2       jc           CS331E  None
3       jc           CS313E  None
4   jerryh           CS327E     B
5   jerryh           CS329E    A-
6   jerryh           CS327E  None
7    kev18           CS329E  None
8    paulg           CS313E  None
9    paulg  CS326E - Fall18    A-
10   paulg           CS329E     A

### Run Student beam pipelines

In [2]:
%run Student_beam1.py

/home/jupyter/venv/lib/python3.5/site-packages/apache_beam/io/gcp/bigquery.py:1421: BeamDeprecationWarning: options is deprecated since First stable release. References to <pipeline>.options will not be supported
  experiments = p.options.view_as(DebugOptions).experiments or []

current dob: 2000-04-22
current dob: 2000-08-22
current dob: 05/10/1999
new dob: 1999-05-10
current dob: 2000-04-08
current dob: 2000-09-17
current dob: 09/17/2000
new dob: 2000-09-17
current dob: 01/10/2000
new dob: 2000-01-10
current dob: 2000-01-10
current dob: 04/22/1998
new dob: 1998-04-22
current dob: 1999-01-03
current dob: 01/03/1999
new dob: 1999-01-03
current dob: 1999-07-31
current dob: 2000-11-07
current dob: 2001-03-03
current dob: 2000-10-01
current dob: 2000-10-01
student_record: {'sid': 'paulg', 'dob': '2000-09-17', 'lname': 'Gore', 'fname': 'Paul'}
student_record: {'sid': 'nitinm', 'dob': '1999-07-31', 'lname': 'Mogal', 'fname': 'Nitin'}
student_record: {'sid': 'bzen26', 'dob': '1998-04-22', 'lname': 'Zen', 'fname': 'Biswa'}
student_record: {'sid': 'natea', 'dob': '2000-04-08', 'lname': 'Anderson', 'fname': 'Nathan'}
student_record: {'sid': 'kgomez9', 'dob': '2001-03-03', 'lname': 'Gomez', 'fname': 'Katie'}
student_record: {'sid': 'jerryh', 'dob': '1999-01-03', 'lname': 'Hargrove', 'fname': 'Jerry'}
student_record: {'sid': 'jc', 'dob': '2000-04-22', 'lname': 'Cowe', 'fname': 'James'}
student_record: {'sid': 'dchen', 'dob': '2000-08-22', 'lname': 'Chen', 'fname': 'David'}
student_record: {'sid': 'sudeepa4', 'dob': '2000-10-01', 'lname': 'Roy', 'fname': 'Sudeepa'}
student_record: {'sid': 'aprilz', 'dob': '2000-01-10', 'lname': 'Lopez', 'fname': 'April'}
student_record: {'sid': 'ryan22', 'dob': '2000-11-07', 'lname': 'Watson', 'fname': 'Ryan'}
student_record: {'sid': 'kev18', 'dob': '1999-05-10', 'lname': 'Lin', 'fname': 'Kevin'}

In [1]:
%%bigquery
drop table college_modeled.Student_Beam

Empty DataFrame
Columns: []
Index: []

In [2]:
%run Student_beam2.py

/home/jupyter/venv/lib/python3.5/site-packages/apache_beam/io/gcp/bigquery.py:1421: BeamDeprecationWarning: options is deprecated since First stable release. References to <pipeline>.options will not be supported
  experiments = p.options.view_as(DebugOptions).experiments or []

current dob: 2000-04-22
current dob: 2000-08-22
current dob: 05/10/1999
new dob: 1999-05-10
current dob: 2000-04-08
current dob: 09/17/2000
new dob: 2000-09-17
current dob: 2000-09-17
current dob: 01/10/2000
new dob: 2000-01-10
current dob: 2000-01-10
current dob: 04/22/1998
new dob: 1998-04-22
current dob: 01/03/1999
new dob: 1999-01-03
current dob: 1999-01-03
current dob: 1999-07-31
current dob: 2000-11-07
current dob: 2001-03-03
current dob: 2000-10-01
current dob: 2000-10-01
student_record: {'dob': '2001-03-03', 'status': 'PRO', 'lname': 'Gomez', 'fname': 'Katie', 'sid': 'kgomez9'}
student_record: {'dob': '2000-04-22', 'status': 'CUR', 'lname': 'Cowe', 'fname': 'James', 'sid': 'jc'}
student_record: {'dob': '1998-04-22', 'status': 'CUR', 'lname': 'Zen', 'fname': 'Biswa', 'sid': 'bzen26'}
student_record: {'dob': '1999-07-31', 'status': 'PRO', 'lname': 'Mogal', 'fname': 'Nitin', 'sid': 'nitinm'}
student_record: {'dob': '2000-04-08', 'status': 'PRO', 'lname': 'Anderson', 'fname': 'Nathan', 'sid': 'natea'}
student_record: {'dob': '1999-05-10', 'status': 'CUR', 'lname': 'Lin', 'fname': 'Kevin', 'sid': 'kev18'}
student_record: {'dob': '1999-01-03', 'status': 'CUR', 'lname': 'Hargrove', 'fname': 'Jerry', 'sid': 'jerryh'}
student_record: {'dob': '2000-11-07', 'status': 'PRO', 'lname': 'Watson', 'fname': 'Ryan', 'sid': 'ryan22'}
student_record: {'dob': '2000-08-22', 'status': 'PRO', 'lname': 'Chen', 'fname': 'David', 'sid': 'dchen'}
student_record: {'dob': '2000-01-10', 'status': 'CUR', 'lname': 'Lopez', 'fname': 'April', 'sid': 'aprilz'}
student_record: {'dob': '2000-10-01', 'status': 'CUR', 'lname': 'Roy', 'fname': 'Sudeepa', 'sid': 'sudeepa4'}
student_record: {'dob': '2000-09-17', 'status': 'CUR', 'lname': 'Gore', 'fname': 'Paul', 'sid': 'paulg'}

In [24]:
%run Student_beam_dataflow1.py

/home/jupyter/venv/lib/python3.5/site-packages/apache_beam/runners/dataflow/dataflow_runner.py:740: BeamDeprecationWarning: BigQuerySink is deprecated since 2.11.0. Use WriteToBigQuery instead.
  kms_key=transform.kms_key))

In [25]:
%%bigquery
drop table college_modeled.Student_Beam_DF

Empty DataFrame
Columns: []
Index: []

In [3]:
%run Student_beam_dataflow2.py

/home/jupyter/venv/lib/python3.5/site-packages/apache_beam/runners/dataflow/dataflow_runner.py:740: BeamDeprecationWarning: BigQuerySink is deprecated since 2.11.0. Use WriteToBigQuery instead.
  kms_key=transform.kms_key))

## Check primary key constraint

In [28]:
%%bigquery
select count(distinct sid) as distinct_sid from college_modeled.Student_Beam

   distinct_sid
0            12

In [29]:
%%bigquery
select count(*) as total_count from college_modeled.Student_Beam

   total_count
0           12

In [33]:
%%bigquery
select count(distinct sid) as distinct_sid from college_modeled.Student_Beam_DF

   distinct_sid
0            12

In [ ]:
%%bigquery
select count(*) as total_count from college_modeled.Student_Beam_DF

### Recreate Class table

In [4]:
%%bigquery
create or replace table college_modeled.Class as
select generate_uuid() as cid, *
from college_modeled.Class

Empty DataFrame
Columns: []
Index: []

In [7]:
%%bigquery
select * from college_modeled.Class
limit 6

,cid,cno,cname,credits
0,1641a16c-05e6-4074-90ef-ef48986f395a,CS347,Data Management,3
1,f393d3ac-f3f3-4318-8648-d184df656b4c,CS373,CS373: Software Engineering,3
2,6eded7a3-a329-48a8-a61a-e91220599962,M328K,Intro to Number Theory,3
3,5456cad5-adb9-46d7-906c-726add37221f,M358K,Applied Statistics,3
4,51e8d8ca-ea5d-4091-96ca-99805db1aaec,M362K,Probability I,3
5,f7f3d16d-cbc4-4568-a337-47756e45dd64,CS313E,Elements of Software Design,3

### Check Primary Key constraint

In [5]:
%%bigquery
select count(*) as class_records from college_modeled.Class

   class_records
0             11

In [6]:
%%bigquery
select count(distinct cid) as unique_class_records from college_modeled.Class

   unique_class_records
0                    11

### Run Teacher beam pipelines

In [31]:
%run Teacher_beam.py

/home/jupyter/venv/lib/python3.5/site-packages/apache_beam/io/gcp/bigquery.py:1421: BeamDeprecationWarning: options is deprecated since First stable release. References to <pipeline>.options will not be supported
  experiments = p.options.view_as(DebugOptions).experiments or []

teacher_record: {'fname': 'Peter', 'lname': 'Mueller', 'dept': 'Mathematics', 'tid': 'mueller'}
teacher_record: {'fname': 'Joe', 'lname': 'Neeman', 'dept': 'Mathematics', 'tid': 'neeman'}
teacher_record: {'fname': 'Shirley', 'lname': 'Cohen', 'dept': 'Computer Science', 'tid': 'scohen'}
teacher_record: {'fname': 'Shyamal', 'lname': 'Mitra', 'dept': 'Computer Science', 'tid': 'mitra'}
teacher_record: {'fname': 'Fares', 'lname': 'Fraij', 'dept': 'Computer Science', 'tid': 'fares'}
teacher_record: {'fname': 'Hans', 'lname': 'Koch', 'dept': 'Mathematics', 'tid': 'koch'}
teacher_record: {'fname': 'Prof.', 'lname': 'Sarah', 'dept': 'Computer Science', 'tid': 'abraham'}
teacher_record: {'fname': 'Bill', 'lname': 'Bulko', 'dept': 'Computer Science', 'tid': 'bulko'}
teacher_record: {'fname': 'Ngoc', 'lname': 'Tran', 'dept': 'Mathematics', 'tid': 'tran'}
teacher_record: {'fname': 'Philip', 'lname': 'Cannata', 'dept': 'Computer Science', 'tid': 'cannata'}

In [32]:
%run Teacher_beam_dataflow.py

/home/jupyter/venv/lib/python3.5/site-packages/apache_beam/runners/dataflow/dataflow_runner.py:740: BeamDeprecationWarning: BigQuerySink is deprecated since 2.11.0. Use WriteToBigQuery instead.
  kms_key=transform.kms_key))

In [8]:
%run Takes_beam.py

/home/jupyter/venv/lib/python3.5/site-packages/apache_beam/io/gcp/bigquery.py:1421: BeamDeprecationWarning: options is deprecated since First stable release. References to <pipeline>.options will not be supported
  experiments = p.options.view_as(DebugOptions).experiments or []

In [1]:
%run Takes_beam_dataflow.py

/home/jupyter/venv/lib/python3.5/site-packages/apache_beam/runners/dataflow/dataflow_runner.py:740: BeamDeprecationWarning: BigQuerySink is deprecated since 2.11.0. Use WriteToBigQuery instead.
  kms_key=transform.kms_key))

### Check Primary Key Constraint

In [3]:
%%bigquery
select count(*) as total_takes from college_modeled.Takes_Beam

   total_takes
0           11

In [4]:
%%bigquery
select count(*) as unique_takes
from
(select distinct sid, cid 
from college_modeled.Takes_Beam)

   unique_takes
0            10

### Fixing Primary Key Violation

In [13]:
%%bigquery
select sid, cid, count(*) as count
from college_modeled.Takes_Beam
group by sid, cid
order by count(*) desc
limit 5

      sid                                   cid  count
0  jerryh  dd1d7e80-90d3-4228-9ce1-17225c6d25bb      2
1   kev18  a7bc5e04-5ce3-4590-860a-0f4aa0ca39fa      1
2      jc  4d8587fc-9e75-481d-bb4d-a6be14857aca      1
3      jc  f7f3d16d-cbc4-4568-a337-47756e45dd64      1
4      jc  dd1d7e80-90d3-4228-9ce1-17225c6d25bb      1

In [14]:
%%bigquery
select * 
from college_modeled.Takes_Beam
where sid = 'jerryh' and cid = 'dd1d7e80-90d3-4228-9ce1-17225c6d25bb'

      sid                                   cid grade
0  jerryh  dd1d7e80-90d3-4228-9ce1-17225c6d25bb     B
1  jerryh  dd1d7e80-90d3-4228-9ce1-17225c6d25bb  None

In [16]:
%%bigquery
delete from college_modeled.Takes_Beam
where sid = 'jerryh' and cid = 'dd1d7e80-90d3-4228-9ce1-17225c6d25bb' and grade is null

Empty DataFrame
Columns: []
Index: []

In [17]:
%%bigquery
select count(*) as total_takes from college_modeled.Takes_Beam

   total_takes
0           10

In [18]:
%%bigquery
select count(*) as unique_takes
from
(select distinct sid, cid 
from college_modeled.Takes_Beam)

   unique_takes
0            10

### Check Foreign Key Constraints

In [6]:
%%bigquery
select count(*) as foreign_key_violations 
from college_modeled.Takes_Beam t left join college_modeled.Student_Beam s on t.sid = s.sid
where s.sid is null

   foreign_key_violations
0                       0

In [8]:
%%bigquery
select count(*) as foreign_key_violations
from college_modeled.Takes_Beam t left join college_modeled.Class c on t.cid = c.cid
where c.cid is null

   foreign_key_violations
0                       0